# KeySourceParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..KeySourceParam Property
ParameterTypeId Class See Also
---
"Key Source"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId KeySourceParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property KeySourceParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ KeySourceParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace